Revit 2026 API

# InsulationTypeSetInsert Method

---

Insert the specified insulation type into the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Insert(
	InsulationType item
)
```
```vb
Public Overridable Function Insert (
	item As InsulationType
) As Boolean
```
```cpp
public:
virtual bool Insert(
	InsulationType^ item
)
```
```fsharp
abstract Insert :
        item : InsulationType -> bool
override Insert :
        item : InsulationType -> bool
```

#### Parameters

item InsulationType
    The insulation type to be inserted into the set.

#### Return Value

BooleanReturns whether the insulation type was inserted into the set.

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace